deneyapkart/deneyapkart-arduino-core/boards.txt
menu.UploadMode=Upload Mode
menu.UploadSpeed=Upload Speed
menu.SerialMode=Serial Connected To
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM

##############################################################

dydk_mpv10.name=Deneyap Kart

dydk_mpv10.upload.tool=esptool_py
dydk_mpv10.upload.maximum_size=1310720
dydk_mpv10.upload.maximum_data_size=327680
dydk_mpv10.upload.flags=
dydk_mpv10.upload.extra_flags=

dydk_mpv10.serial.disableDTR=true
dydk_mpv10.serial.disableRTS=true

dydk_mpv10.build.tarch=xtensa
dydk_mpv10.build.bootloader_addr=0x1000
dydk_mpv10.build.target=esp32
dydk_mpv10.build.mcu=esp32
dydk_mpv10.build.core=esp32
dydk_mpv10.build.variant=dydk_mpv10
dydk_mpv10.build.board=DYDK

dydk_mpv10.build.f_cpu=240000000L
dydk_mpv10.build.flash_size=4MB
dydk_mpv10.build.flash_freq=40m
dydk_mpv10.build.flash_mode=dio
dydk_mpv10.build.boot=dio
dydk_mpv10.build.partitions=default
dydk_mpv10.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
dydk_mpv10.build.extra_libs=

dydk_mpv10.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
dydk_mpv10.menu.PartitionScheme.default.build.partitions=default
dydk_mpv10.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
dydk_mpv10.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
dydk_mpv10.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
dydk_mpv10.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
dydk_mpv10.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
dydk_mpv10.menu.PartitionScheme.minimal.build.partitions=minimal
dydk_mpv10.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
dydk_mpv10.menu.PartitionScheme.no_ota.build.partitions=no_ota
dydk_mpv10.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
dydk_mpv10.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
dydk_mpv10.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
dydk_mpv10.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
dydk_mpv10.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
dydk_mpv10.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
dydk_mpv10.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
dydk_mpv10.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
dydk_mpv10.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
dydk_mpv10.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
dydk_mpv10.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
dydk_mpv10.menu.PartitionScheme.huge_app.build.partitions=huge_app
dydk_mpv10.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
dydk_mpv10.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
dydk_mpv10.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
dydk_mpv10.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
dydk_mpv10.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
dydk_mpv10.menu.PartitionScheme.fatflash.build.partitions=ffat

dydk_mpv10.menu.CPUFreq.240=240MHz (WiFi/BT)
dydk_mpv10.menu.CPUFreq.240.build.f_cpu=240000000L
dydk_mpv10.menu.CPUFreq.160=160MHz (WiFi/BT)
dydk_mpv10.menu.CPUFreq.160.build.f_cpu=160000000L
dydk_mpv10.menu.CPUFreq.80=80MHz (WiFi/BT)
dydk_mpv10.menu.CPUFreq.80.build.f_cpu=80000000L
dydk_mpv10.menu.CPUFreq.40=40MHz
dydk_mpv10.menu.CPUFreq.40.build.f_cpu=40000000L
dydk_mpv10.menu.CPUFreq.20=20MHz 
dydk_mpv10.menu.CPUFreq.20.build.f_cpu=20000000L
dydk_mpv10.menu.CPUFreq.10=10MHz
dydk_mpv10.menu.CPUFreq.10.build.f_cpu=10000000L

dydk_mpv10.menu.FlashMode.qio=QIO
dydk_mpv10.menu.FlashMode.qio.build.flash_mode=dio
dydk_mpv10.menu.FlashMode.qio.build.boot=qio
dydk_mpv10.menu.FlashMode.dio=DIO
dydk_mpv10.menu.FlashMode.dio.build.flash_mode=dio
dydk_mpv10.menu.FlashMode.dio.build.boot=dio
dydk_mpv10.menu.FlashMode.qout=QOUT
dydk_mpv10.menu.FlashMode.qout.build.flash_mode=dout
dydk_mpv10.menu.FlashMode.qout.build.boot=qout
dydk_mpv10.menu.FlashMode.dout=DOUT
dydk_mpv10.menu.FlashMode.dout.build.flash_mode=dout
dydk_mpv10.menu.FlashMode.dout.build.boot=dout

dydk_mpv10.menu.FlashFreq.80=80MHz
dydk_mpv10.menu.FlashFreq.80.build.flash_freq=80m
dydk_mpv10.menu.FlashFreq.40=40MHz
dydk_mpv10.menu.FlashFreq.40.build.flash_freq=40m

dydk_mpv10.menu.UploadMode.Auto=Auto
dydk_mpv10.menu.UploadMode.Auto.upload.mode=default_reset
dydk_mpv10.menu.UploadMode.Manual=Manual
dydk_mpv10.menu.UploadMode.Manual.upload.mode=no_reset

dydk_mpv10.menu.UploadSpeed.921600=921600
dydk_mpv10.menu.UploadSpeed.921600.upload.speed=921600
dydk_mpv10.menu.UploadSpeed.115200=115200
dydk_mpv10.menu.UploadSpeed.115200.upload.speed=115200
dydk_mpv10.menu.UploadSpeed.256000.windows=256000
dydk_mpv10.menu.UploadSpeed.256000.upload.speed=256000
dydk_mpv10.menu.UploadSpeed.230400.windows.upload.speed=256000
dydk_mpv10.menu.UploadSpeed.230400=230400
dydk_mpv10.menu.UploadSpeed.230400.upload.speed=230400
dydk_mpv10.menu.UploadSpeed.460800.linux=460800
dydk_mpv10.menu.UploadSpeed.460800.macosx=460800
dydk_mpv10.menu.UploadSpeed.460800.upload.speed=460800
dydk_mpv10.menu.UploadSpeed.512000.windows=512000
dydk_mpv10.menu.UploadSpeed.512000.upload.speed=512000

dydk_mpv10.menu.DebugLevel.none=None
dydk_mpv10.menu.DebugLevel.none.build.code_debug=0
dydk_mpv10.menu.DebugLevel.error=Error
dydk_mpv10.menu.DebugLevel.error.build.code_debug=1
dydk_mpv10.menu.DebugLevel.warn=Warn
dydk_mpv10.menu.DebugLevel.warn.build.code_debug=2
dydk_mpv10.menu.DebugLevel.info=Info
dydk_mpv10.menu.DebugLevel.info.build.code_debug=3
dydk_mpv10.menu.DebugLevel.debug=Debug
dydk_mpv10.menu.DebugLevel.debug.build.code_debug=4
dydk_mpv10.menu.DebugLevel.verbose=Verbose
dydk_mpv10.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

dym_mpv10.name=Deneyap Mini

dym_mpv10.vid.0=0x303a
dym_mpv10.pid.0=0x0002

dym_mpv10.upload.tool=esptool_py
dym_mpv10.upload.maximum_size=1310720
dym_mpv10.upload.maximum_data_size=327680
dym_mpv10.upload.flags=
dym_mpv10.upload.extra_flags=
dym_mpv10.upload.use_1200bps_touch=true
dym_mpv10.upload.wait_for_upload_port=true

dym_mpv10.serial.disableDTR=false
dym_mpv10.serial.disableRTS=false

dym_mpv10.build.tarch=xtensa
dym_mpv10.build.bootloader_addr=0x1000
dym_mpv10.build.target=esp32s2
dym_mpv10.build.mcu=esp32s2
dym_mpv10.build.core=esp32
dym_mpv10.build.variant=dym_mpv10
dym_mpv10.build.board=DYM

dym_mpv10.build.serial=0
dym_mpv10.build.f_cpu=240000000L
dym_mpv10.build.flash_size=4MB
dym_mpv10.build.flash_freq=80m
dym_mpv10.build.flash_mode=qio
dym_mpv10.build.boot=qio
dym_mpv10.build.partitions=default
dym_mpv10.build.defines=

dym_mpv10.menu.SerialMode.default=USB_CDC
dym_mpv10.menu.SerialMode.default.build.serial=1
dym_mpv10.menu.SerialMode.uart=UART0
dym_mpv10.menu.SerialMode.uart.build.serial=0

dym_mpv10.menu.PSRAM.disabled=Disabled
dym_mpv10.menu.PSRAM.disabled.build.defines=
dym_mpv10.menu.PSRAM.enabled=Enabled
dym_mpv10.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM

dym_mpv10.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
dym_mpv10.menu.PartitionScheme.default.build.partitions=default
dym_mpv10.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
dym_mpv10.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
dym_mpv10.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
dym_mpv10.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
dym_mpv10.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
dym_mpv10.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
dym_mpv10.menu.PartitionScheme.minimal.build.partitions=minimal
dym_mpv10.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
dym_mpv10.menu.PartitionScheme.no_ota.build.partitions=no_ota
dym_mpv10.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
dym_mpv10.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
dym_mpv10.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
dym_mpv10.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
dym_mpv10.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
dym_mpv10.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
dym_mpv10.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
dym_mpv10.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
dym_mpv10.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
dym_mpv10.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
dym_mpv10.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
dym_mpv10.menu.PartitionScheme.huge_app.build.partitions=huge_app
dym_mpv10.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
dym_mpv10.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
dym_mpv10.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
dym_mpv10.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
dym_mpv10.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
dym_mpv10.menu.PartitionScheme.fatflash.build.partitions=ffat
dym_mpv10.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
dym_mpv10.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
dym_mpv10.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
dym_mpv10.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728

dym_mpv10.menu.CPUFreq.240=240MHz (WiFi)
dym_mpv10.menu.CPUFreq.240.build.f_cpu=240000000L
dym_mpv10.menu.CPUFreq.160=160MHz (WiFi)
dym_mpv10.menu.CPUFreq.160.build.f_cpu=160000000L
dym_mpv10.menu.CPUFreq.80=80MHz (WiFi)
dym_mpv10.menu.CPUFreq.80.build.f_cpu=80000000L
dym_mpv10.menu.CPUFreq.40=40MHz
dym_mpv10.menu.CPUFreq.40.build.f_cpu=40000000L
dym_mpv10.menu.CPUFreq.20=20MHz
dym_mpv10.menu.CPUFreq.20.build.f_cpu=20000000L
dym_mpv10.menu.CPUFreq.10=10MHz
dym_mpv10.menu.CPUFreq.10.build.f_cpu=10000000L

dym_mpv10.menu.FlashMode.qio=QIO
dym_mpv10.menu.FlashMode.qio.build.flash_mode=dio
dym_mpv10.menu.FlashMode.qio.build.boot=qio
dym_mpv10.menu.FlashMode.dio=DIO
dym_mpv10.menu.FlashMode.dio.build.flash_mode=dio
dym_mpv10.menu.FlashMode.dio.build.boot=dio
dym_mpv10.menu.FlashMode.qout=QOUT
dym_mpv10.menu.FlashMode.qout.build.flash_mode=dout
dym_mpv10.menu.FlashMode.qout.build.boot=qout
dym_mpv10.menu.FlashMode.dout=DOUT
dym_mpv10.menu.FlashMode.dout.build.flash_mode=dout
dym_mpv10.menu.FlashMode.dout.build.boot=dout

dym_mpv10.menu.FlashFreq.80=80MHz
dym_mpv10.menu.FlashFreq.80.build.flash_freq=80m
dym_mpv10.menu.FlashFreq.40=40MHz
dym_mpv10.menu.FlashFreq.40.build.flash_freq=40m

dym_mpv10.menu.FlashSize.4M=4MB (32Mb)
dym_mpv10.menu.FlashSize.4M.build.flash_size=4MB
dym_mpv10.menu.FlashSize.8M=8MB (64Mb)
dym_mpv10.menu.FlashSize.8M.build.flash_size=8MB
dym_mpv10.menu.FlashSize.8M.build.partitions=default_8MB
dym_mpv10.menu.FlashSize.2M=2MB (16Mb)
dym_mpv10.menu.FlashSize.2M.build.flash_size=2MB
dym_mpv10.menu.FlashSize.2M.build.partitions=minimal
dym_mpv10.menu.FlashSize.16M=16MB (128Mb)
dym_mpv10.menu.FlashSize.16M.build.flash_size=16MB

dym_mpv10.menu.UploadMode.Auto=Auto
dym_mpv10.menu.UploadMode.Auto.upload.mode=default_reset
dym_mpv10.menu.UploadMode.Manual=Manual
dym_mpv10.menu.UploadMode.Manual.upload.mode=no_reset

dym_mpv10.menu.UploadSpeed.921600=921600
dym_mpv10.menu.UploadSpeed.921600.upload.speed=921600
dym_mpv10.menu.UploadSpeed.115200=115200
dym_mpv10.menu.UploadSpeed.115200.upload.speed=115200
dym_mpv10.menu.UploadSpeed.256000.windows=256000
dym_mpv10.menu.UploadSpeed.256000.upload.speed=256000
dym_mpv10.menu.UploadSpeed.230400.windows.upload.speed=256000
dym_mpv10.menu.UploadSpeed.230400=230400
dym_mpv10.menu.UploadSpeed.230400.upload.speed=230400
dym_mpv10.menu.UploadSpeed.460800.linux=460800
dym_mpv10.menu.UploadSpeed.460800.macosx=460800
dym_mpv10.menu.UploadSpeed.460800.upload.speed=460800
dym_mpv10.menu.UploadSpeed.512000.windows=512000
dym_mpv10.menu.UploadSpeed.512000.upload.speed=512000

dym_mpv10.menu.DebugLevel.none=None
dym_mpv10.menu.DebugLevel.none.build.code_debug=0
dym_mpv10.menu.DebugLevel.error=Error
dym_mpv10.menu.DebugLevel.error.build.code_debug=1
dym_mpv10.menu.DebugLevel.warn=Warn
dym_mpv10.menu.DebugLevel.warn.build.code_debug=2
dym_mpv10.menu.DebugLevel.info=Info
dym_mpv10.menu.DebugLevel.info.build.code_debug=3
dym_mpv10.menu.DebugLevel.debug=Debug
dym_mpv10.menu.DebugLevel.debug.build.code_debug=4
dym_mpv10.menu.DebugLevel.verbose=Verbose
dym_mpv10.menu.DebugLevel.verbose.build.code_debug=5

##############################################################
